IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/QSPI0_QSPI0.xml
<module name="QSPI0_QSPI0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="QSPI0_PID" acronym="QSPI0_PID" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="The scheme of the register used. This indicates the PDR3.5 Method" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="2" begin="29" end="28" resetval="0x0" description="Always read as 0" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x3904" description="The function of the module being used" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x0" description="RTL Release Version The PDR release number of this IP" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x0" description="Major Release Number" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom IP" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor Release Number" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="QSPI0_MSS_QSPI_RESERVED1" acronym="QSPI0_MSS_QSPI_RESERVED1" offset="0x4" width="32" description="">
		
	</register>
	<register id="QSPI0_MSS_QSPI_RESERVED2" acronym="QSPI0_MSS_QSPI_RESERVED2" offset="0x8" width="32" description="">
		
	</register>
	<register id="QSPI0_MSS_QSPI_RESERVED3" acronym="QSPI0_MSS_QSPI_RESERVED3" offset="0xC" width="32" description="">
		
	</register>
	<register id="QSPI0_SYSCONFIG" acronym="QSPI0_SYSCONFIG" offset="0x10" width="32" description="">
		<bitfield id="RESERVED3" width="26" begin="31" end="6" resetval="0x0" description="Always read as 0" range="31 - 6" rwaccess="RO"/> 
		<bitfield id="RESERVED2" width="2" begin="5" end="4" resetval="0x0" description="Always read as 0" range="5 - 4" rwaccess="RO"/> 
		<bitfield id="IDLEMODE" width="2" begin="3" end="2" resetval="0x2" description="Configuration of the local target state management mode. By definition, target can handle read/write transaction as long as it is out of IDLE state0x0 : Force-idle mode: local target's idle state follows (acknowledges) the system's idle requests unconditionally, i.e. regardless of the IP module's internal requirements. Backup mode, for debug only0x1 : No-idle mode: local target never enters idle state. Backup mode, for debug only0x2 : Smart-idle mode: local target's idle state eventually follows (acknowledges) the system's idle requests, depending on the IP module's internal requirements. IP module shall not generate (IRQ- or DMA-request-related) wakeup events0x3 : Smart-idle wakeup-capable mode: local target's idle state eventually follows (acknowledges) the system's idle requests, depending on the IP module's internal requirements. IP module may generate (IRQ- or DMA-request-related) wakeup events when in idle state.Mode is only relevant if the appropriate IP module 'swakeup' output(s) is (are) implemented" range="3 - 2" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="2" begin="1" end="0" resetval="0x0" description="Always read as 0" range="1 - 0" rwaccess="RO"/>
	</register>
	<register id="QSPI0_MSS_QSPI_RESERVED4" acronym="QSPI0_MSS_QSPI_RESERVED4" offset="0x14" width="32" description="">
		
	</register>
	<register id="QSPI0_MSS_QSPI_RESERVED5" acronym="QSPI0_MSS_QSPI_RESERVED5" offset="0x18" width="32" description="">
		
	</register>
	<register id="QSPI0_MSS_QSPI_RESERVED6" acronym="QSPI0_MSS_QSPI_RESERVED6" offset="0x1C" width="32" description="">
		
	</register>
	<register id="QSPI0_INTR_STATUS_RAW_SET" acronym="QSPI0_INTR_STATUS_RAW_SET" offset="0x20" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0" range="31 - 2" rwaccess="RO"/> 
		<bitfield id="WIRQ_RAW" width="1" begin="1" end="1" resetval="0x0" description="Word Interrupt Status Read indicates raw status0 = inactive1 = activeWriting 1 will set statusWriting 0 has no effect" range="1" rwaccess="RW"/> 
		<bitfield id="FIRQ_RAW" width="1" begin="0" end="0" resetval="0x0" description="Frame Interrupt StatusRead indicates raw status0 = inactive1 = activeWriting 1 will set statusWriting 0 has no effect" range="0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_INTR_STATUS_ENABLED_CLEAR" acronym="QSPI0_INTR_STATUS_ENABLED_CLEAR" offset="0x24" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0" range="31 - 2" rwaccess="RO"/> 
		<bitfield id="WIRQ_ENA" width="1" begin="1" end="1" resetval="0x0" description="Word  Interrupt Enabled StatusRead indicates enabled status0 = inactive1 = activeWriting 1 will clear interruptWriting 0 has no effect" range="1" rwaccess="RW"/> 
		<bitfield id="FIRQ_ENA" width="1" begin="0" end="0" resetval="0x0" description="Frame Interrupt Enabled StatusRead indicates enabled status0 = inactive1 = activeWriting 1 will clear interruptWriting 0 has no effect" range="0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_INTR_ENABLE_SET" acronym="QSPI0_INTR_ENABLE_SET" offset="0x28" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0" range="31 - 2" rwaccess="RO"/> 
		<bitfield id="WIRQ_ENA_SET" width="1" begin="1" end="1" resetval="0x0" description="Word Interrupt  Enable/SetRead indicates interrupt enable0 = disabled1 = enabledWriting 1 will set interrupt enabledWriting 0 has no effect" range="1" rwaccess="RW"/> 
		<bitfield id="FIRQ_ENA_SET" width="1" begin="0" end="0" resetval="0x0" description="Frame Interrupt Enable/SetRead indicates interrupt enable0 = disabled1 = enabledWriting 1 will set interrupt enabledWriting 0 has no effect" range="0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_INTR_ENABLE_CLEAR" acronym="QSPI0_INTR_ENABLE_CLEAR" offset="0x2C" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0" range="31 - 2" rwaccess="RO"/> 
		<bitfield id="WIRQ_ENA_CLR" width="1" begin="1" end="1" resetval="0x0" description="Word Interrupt  Enable/ClearRead indicates interrupt enable0 = disabled1 = enabledWriting 1 will clear interrupt enabledWriting 0 has no effect" range="1" rwaccess="RW"/> 
		<bitfield id="FIRQ_ENA_CLR" width="1" begin="0" end="0" resetval="0x0" description="Frame Interrupt  Enable/ClearRead indicates interrupt enable0 = disabled1 = enabledWriting 1 will clear interrupt enabledWriting 0 has no effect" range="0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_INTC_EOI" acronym="QSPI0_INTC_EOI" offset="0x30" width="32" description="">
		<bitfield id="EOI_VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Number associated with the ipgenericirq for intr output.  There are 1 interrupt outputsWrite 0x0 : Write to intr IP GenericAny other write value is ignored." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_MSS_QSPI_RESERVED7" acronym="QSPI0_MSS_QSPI_RESERVED7" offset="0x34" width="32" description="">
		
	</register>
	<register id="QSPI0_MSS_QSPI_RESERVED8" acronym="QSPI0_MSS_QSPI_RESERVED8" offset="0x38" width="32" description="">
		
	</register>
	<register id="QSPI0_MSS_QSPI_RESERVED9" acronym="QSPI0_MSS_QSPI_RESERVED9" offset="0x3C" width="32" description="">
		
	</register>
	<register id="QSPI0_SPI_CLOCK_CNTRL" acronym="QSPI0_SPI_CLOCK_CNTRL" offset="0x40" width="32" description="">
		<bitfield id="CLKEN" width="1" begin="31" end="31" resetval="0x0" description="Clock Enable. 0- Data clock is turned off1- Data clock is enabled" range="31" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="15" begin="30" end="16" resetval="0x0" description="Always read as 0" range="30 - 16" rwaccess="RO"/> 
		<bitfield id="DCLK_DIV" width="16" begin="15" end="0" resetval="0x0" description="Serial data clock divide by ratio" range="15 - 0" rwaccess="RW"/>
	</register>
