IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/QSPI0_QSPI0.xml
	<register id="QSPI0_SPI_DC" acronym="QSPI0_SPI_DC" offset="0x44" width="32" description="">
		<bitfield id="RESERVED4" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31 - 29" rwaccess="RO"/> 
		<bitfield id="DD3" width="2" begin="28" end="27" resetval="0x0" description="Data delay for chip select 300-  Data is output on the same cycle as the CS_N goes active01-  Data is output 1 DCLK cycle after the CS_N goes active 10-  Data is output 2 DCLK cycles after the CS_N goes active11-  Data is output 3 DCLK cycles after the CS_N goes active" range="28 - 27" rwaccess="RW"/> 
		<bitfield id="CKPH3" width="1" begin="26" end="26" resetval="0x0" description="Clock phase for chip select 3 If CKP0 = 0  0- Data shifted out on falling edge; input on rising edge  1- Data shifted out on rising edge; input on falling edgeIf CKP0 = 1  1- Data shifted out on falling edge; input on rising edge  0- Data shifted out on rising edge; input on falling edge" range="26" rwaccess="RW"/> 
		<bitfield id="CSP3" width="1" begin="25" end="25" resetval="0x0" description="Chip select polarity for chip select 30- Active low1- Active high" range="25" rwaccess="RW"/> 
		<bitfield id="CKP3" width="1" begin="24" end="24" resetval="0x0" description="Clock polarity for chip select 30- When data is not being transferred, SCK = 01- When data is not being transferred, SCK = 1" range="24" rwaccess="RW"/> 
		<bitfield id="RESERVED3" width="3" begin="23" end="21" resetval="0x0" description="Always read as 0" range="23 - 21" rwaccess="RO"/> 
		<bitfield id="DD2" width="2" begin="20" end="19" resetval="0x0" description="Data delay for chip select 200-  Data is output on the same cycle as the CS_N goes active01-  Data is output 1 DCLK cycle after the CS_N goes active 10-  Data is output 2 DCLK cycles after the CS_N goes active11-  Data is output 3 DCLK cycles after the CS_N goes active" range="20 - 19" rwaccess="RW"/> 
		<bitfield id="CKPH2" width="1" begin="18" end="18" resetval="0x0" description="Clock phase for chip select 2.  If CKP0 = 0  0- Data shifted out on falling edge; input on rising edge  1- Data shifted out on rising edge; input on falling edgeIf CKP0 = 1  1- Data shifted out on falling edge; input on rising edge  0- Data shifted out on rising edge; input on falling edge" range="18" rwaccess="RW"/> 
		<bitfield id="CSP2" width="1" begin="17" end="17" resetval="0x0" description="Chip select polarity for chip select 20- Active low1- Active high" range="17" rwaccess="RW"/> 
		<bitfield id="CKP2" width="1" begin="16" end="16" resetval="0x0" description="Clock polarity for chip select 20- When data is not being transferred, SCK = 01- When data is not being transferred, SCK = 1" range="16" rwaccess="RW"/> 
		<bitfield id="RESERVED2" width="3" begin="15" end="13" resetval="0x0" description="Always read as 0" range="15 - 13" rwaccess="RO"/> 
		<bitfield id="DD1" width="2" begin="12" end="11" resetval="0x0" description="Data delay for chip select 100-  Data is output on the same cycle as the CS_N goes active01-  Data is output 1 DCLK cycle after the CS_N goes active 10-  Data is output 2 DCLK cycles after the CS_N goes active11-  Data is output 3 DCLK cycles after the CS_N goes active" range="12 - 11" rwaccess="RW"/> 
		<bitfield id="CKPH1" width="1" begin="10" end="10" resetval="0x0" description="Clock phase for chip select 1.  If CKP0 = 0  0- Data shifted out on falling edge; input on rising edge  1- Data shifted out on rising edge; input on falling edgeIf CKP0 = 1  1- Data shifted out on falling edge; input on rising edge  0- Data shifted out on rising edge; input on falling edge" range="10" rwaccess="RW"/> 
		<bitfield id="CSP1" width="1" begin="9" end="9" resetval="0x0" description="Chip select polarity for chip select 10- Active low1- Active high" range="9" rwaccess="RW"/> 
		<bitfield id="CKP1" width="1" begin="8" end="8" resetval="0x0" description="Clock polarity for chip select 10- When data is not being transferred, SCK = 01- When data is not being transferred, SCK = 1" range="8" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="3" begin="7" end="5" resetval="0x0" description="Always read as 0" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="DD0" width="2" begin="4" end="3" resetval="0x0" description="Data delay for chip select 000-  Data is output on the same cycle as the CS_N goes active01-  Data is output 1 DCLK cycle after the CS_N goes active 10-  Data is output 2 DCLK cycles after the CS_N goes active11-  Data is output 3 DCLK cycles after the CS_N goes active" range="4 - 3" rwaccess="RW"/> 
		<bitfield id="CKPH0" width="1" begin="2" end="2" resetval="0x0" description="Clock phase for chip select 0.  If CKP0 = 0  0- Data shifted out on falling edge; input on rising edge  1- Data shifted out on rising edge; input on falling edgeIf CKP0 = 1  1- Data shifted out on falling edge; input on rising edge  0- Data shifted out on rising edge; input on falling edge" range="2" rwaccess="RW"/> 
		<bitfield id="CSP0" width="1" begin="1" end="1" resetval="0x0" description="Chip select polarity for chip select 00- Active low1- Active high" range="1" rwaccess="RW"/> 
		<bitfield id="CKP0" width="1" begin="0" end="0" resetval="0x0" description="Clock polarity for chip select 00- When data is not being transferred, SCK = 01- When data is not being transferred, SCK = 1" range="0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_SPI_CMD" acronym="QSPI0_SPI_CMD" offset="0x48" width="32" description="">
		<bitfield id="RESERVED3" width="2" begin="31" end="30" resetval="0x0" description="Always read as 0" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="CSNUM" width="2" begin="29" end="28" resetval="0x0" description="Device select.  Sets the active chip select for the transfer00-  Chip Select 0 active01-  Chip Select 1 active10-  Chip Select 2 active11-  Chip Select 3 active" range="29 - 28" rwaccess="RW"/> 
		<bitfield id="RESERVED2" width="2" begin="27" end="26" resetval="0x0" description="Always read as 0" range="27 - 26" rwaccess="RO"/> 
		<bitfield id="WLEN" width="7" begin="25" end="19" resetval="0x0" description="Word length.  Sets the size of the individual transfers from 1 ? 128 bits0- 1 bit1- 2 bits?127 ? 128 bits" range="25 - 19" rwaccess="RW"/> 
		<bitfield id="CMD" width="3" begin="18" end="16" resetval="0x0" description="Transfer command000-  Reserved001-  4 pin Read Single 010-  4 pin Write  Single011-  4 pin Read Dual100 ? Reserved101 ? 3 pin Read Single110 ? 3 pin Write Single 111 ? 6 pin Read Quad" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="FIRQ" width="1" begin="15" end="15" resetval="0x0" description="Frame count interrupt enable" range="15" rwaccess="RW"/> 
		<bitfield id="WIRQ" width="1" begin="14" end="14" resetval="0x0" description="Word count interrupt enable" range="14" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="2" begin="13" end="12" resetval="0x0" description="Always read as 0" range="13 - 12" rwaccess="RO"/> 
		<bitfield id="FLEN" width="12" begin="11" end="0" resetval="0x0" description="Frame Length0- 1 word1- 2 words?4095 ? 4096 words" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_SPI_STATUS" acronym="QSPI0_SPI_STATUS" offset="0x4C" width="32" description="">
		<bitfield id="RESERVED2" width="4" begin="31" end="28" resetval="0x0" description="Always read as 0" range="31 - 28" rwaccess="RO"/> 
		<bitfield id="WDCNT" width="12" begin="27" end="16" resetval="0x0" description="Word count.  This field will reflect the 1-4096 words transferred" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="13" begin="15" end="3" resetval="0x0" description="Always read as 0" range="15 - 3" rwaccess="RO"/> 
		<bitfield id="FC" width="1" begin="2" end="2" resetval="0x0" description="Frame complete.  This bit is set after all of the requested words have been transmitted.0- Transfer is not complete1- Transfer is completeThis bit is reset when the SPI Status Register is read" range="2" rwaccess="RO"/> 
		<bitfield id="WC" width="1" begin="1" end="1" resetval="0x0" description="Word complete.  This bit is set after each word transfer is completed.0- Word transfer is not complete1- Word transfer is completeThis bit is reset when the SPI Status Register is read" range="1" rwaccess="RO"/> 
		<bitfield id="BUSY" width="1" begin="0" end="0" resetval="0x0" description="Busy bit.  Active transfer in progress.  This bit is only set during an active word transfer.  Between words, the bit will clear to signal that it is ok to read/write the data registers.0- Idle1- Busy" range="0" rwaccess="RO"/>
	</register>
