IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/QSPI0_QSPI0.xml
	<register id="QSPI0_SPI_DATA" acronym="QSPI0_SPI_DATA" offset="0x50" width="32" description="">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Data register for read and write operations" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_SPI_SETUP0" acronym="QSPI0_SPI_SETUP0" offset="0x54" width="32" description="">
		<bitfield id="RESERVED2" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31 - 29" rwaccess="RO"/> 
		<bitfield id="NUM_D_BITS" width="5" begin="28" end="24" resetval="0x0" description="Number of dummy bits to use if NUM_D_BYTES = 0" range="28 - 24" rwaccess="RW"/> 
		<bitfield id="WCMD" width="8" begin="23" end="16" resetval="0x2" description="Write Command" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="2" begin="15" end="14" resetval="0x0" description="Always read as 0" range="15 - 14" rwaccess="RO"/> 
		<bitfield id="READ_TYPE" width="2" begin="13" end="12" resetval="0x0" description="Determines if the read command is a single, dual or quad read mode command00 ? Normal read (all data input on spi_din)01 ? Dual read (odd bytes input on spi_din; even on spi_dout)10 ? Normal read (all data input on spi_din)11 ? Quad read (uses spi_qdin0/1)" range="13 - 12" rwaccess="RW"/> 
		<bitfield id="NUM_D_BYTES" width="2" begin="11" end="10" resetval="0x0" description="Number of dummy bytes to be used for fast read. 0 = use the value in NUM_D_BITS1 = use 8 bits; 2 = use 16 bits; 3 = use 24 bits" range="11 - 10" rwaccess="RW"/> 
		<bitfield id="NUM_A_BYTES" width="2" begin="9" end="8" resetval="0x2" description="Number of address bytes to be sent. 0 = 1 byte; 1 = 2 bytes; 2 = 3 bytes; 3 = 4 bytes" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="RCMD" width="8" begin="7" end="0" resetval="0x3" description="Read Command" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_SPI_SETUP1" acronym="QSPI0_SPI_SETUP1" offset="0x58" width="32" description="">
		<bitfield id="RESERVED2" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31 - 29" rwaccess="RO"/> 
		<bitfield id="NUM_D_BITS" width="5" begin="28" end="24" resetval="0x0" description="Number of dummy bits to use if NUM_D_BYTES = 0" range="28 - 24" rwaccess="RW"/> 
		<bitfield id="WCMD" width="8" begin="23" end="16" resetval="0x2" description="Write Command" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="2" begin="15" end="14" resetval="0x0" description="Always read as 0" range="15 - 14" rwaccess="RO"/> 
		<bitfield id="READ_TYPE" width="2" begin="13" end="12" resetval="0x0" description="Determines if the read command is a single, dual or quad read mode command00 ? Normal read (all data input on spi_din)01 ? Dual read (odd bytes input on spi_din; even on spi_dout)10 ? Normal read (all data input on spi_din)11 ? Quad read (uses spi_qdin0/1)" range="13 - 12" rwaccess="RW"/> 
		<bitfield id="NUM_D_BYTES" width="2" begin="11" end="10" resetval="0x0" description="Number of dummy bytes to be used for fast read. 0 = use the value in NUM_D_BITS1 = use 8 bits; 2 = use 16 bits; 3 = use 24 bits" range="11 - 10" rwaccess="RW"/> 
		<bitfield id="NUM_A_BYTES" width="2" begin="9" end="8" resetval="0x2" description="Number of address bytes to be sent. 0 = 1 byte; 1 = 2 bytes; 2 = 3 bytes; 3 = 4 bytes" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="RCMD" width="8" begin="7" end="0" resetval="0x3" description="Read Command" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_SPI_SETUP2" acronym="QSPI0_SPI_SETUP2" offset="0x5C" width="32" description="">
		<bitfield id="RESERVED2" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31 - 29" rwaccess="RO"/> 
		<bitfield id="NUM_D_BITS" width="5" begin="28" end="24" resetval="0x0" description="Number of dummy bits to use if NUM_D_BYTES = 0" range="28 - 24" rwaccess="RW"/> 
		<bitfield id="WCMD" width="8" begin="23" end="16" resetval="0x2" description="Write Command" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="2" begin="15" end="14" resetval="0x0" description="Always read as 0" range="15 - 14" rwaccess="RO"/> 
		<bitfield id="READ_TYPE" width="2" begin="13" end="12" resetval="0x0" description="Determines if the read command is a single, dual or quad read mode command00 ? Normal read (all data input on spi_din)01 ? Dual read (odd bytes input on spi_din; even on spi_dout)10 ? Normal read (all data input on spi_din)11 ? Quad read (uses spi_qdin0/1)" range="13 - 12" rwaccess="RW"/> 
		<bitfield id="NUM_D_BYTES" width="2" begin="11" end="10" resetval="0x0" description="Number of dummy bytes to be used for fast read. 0 = use the value in NUM_D_BITS1 = use 8 bits; 2 = use 16 bits; 3 = use 24 bits" range="11 - 10" rwaccess="RW"/> 
		<bitfield id="NUM_A_BYTES" width="2" begin="9" end="8" resetval="0x2" description="Number of address bytes to be sent. 0 = 1 byte; 1 = 2 bytes; 2 = 3 bytes; 3 = 4 bytes" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="RCMD" width="8" begin="7" end="0" resetval="0x3" description="Read Command" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_SPI_SETUP3" acronym="QSPI0_SPI_SETUP3" offset="0x60" width="32" description="">
		<bitfield id="RESERVED2" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31 - 29" rwaccess="RO"/> 
		<bitfield id="NUM_D_BITS" width="5" begin="28" end="24" resetval="0x0" description="Number of dummy bits to use if NUM_D_BYTES = 0" range="28 - 24" rwaccess="RW"/> 
		<bitfield id="WCMD" width="8" begin="23" end="16" resetval="0x2" description="Write Command" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="2" begin="15" end="14" resetval="0x0" description="Always read as 0" range="15 - 14" rwaccess="RO"/> 
		<bitfield id="READ_TYPE" width="2" begin="13" end="12" resetval="0x0" description="Determines if the read command is a single, dual or quad read mode command00 ? Normal read (all data input on spi_din)01 ? Dual read (odd bytes input on spi_din; even on spi_dout)10 ? Normal read (all data input on spi_din)11 ? Quad read (uses spi_qdin0/1)" range="13 - 12" rwaccess="RW"/> 
		<bitfield id="NUM_D_BYTES" width="2" begin="11" end="10" resetval="0x0" description="Number of dummy bytes to be used for fast read. 0 = use the value in NUM_D_BITS1 = use 8 bits; 2 = use 16 bits; 3 = use 24 bits" range="11 - 10" rwaccess="RW"/> 
		<bitfield id="NUM_A_BYTES" width="2" begin="9" end="8" resetval="0x2" description="Number of address bytes to be sent. 0 = 1 byte; 1 = 2 bytes; 2 = 3 bytes; 3 = 4 bytes" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="RCMD" width="8" begin="7" end="0" resetval="0x3" description="Read Command" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_SPI_SWITCH" acronym="QSPI0_SPI_SWITCH" offset="0x64" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0" range="31 - 2" rwaccess="RO"/> 
		<bitfield id="MM_INT_EN" width="1" begin="1" end="1" resetval="0x0" description="Memory Mapped mode interrupt enable.0 ? Interrupts are disabled during memory mapped operations1 ? Word Count interrupt is enabled for memory mapped operations" range="1" rwaccess="RW"/> 
		<bitfield id="MMPT_S" width="1" begin="0" end="0" resetval="0x0" description="MMPT select.  If 0 (default) config port has is selected to control config of core SPI module.  If 1, Memory Mapped Protocol Translator is selected to control config port of core SPI module." range="0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_SPI_DATA1" acronym="QSPI0_SPI_DATA1" offset="0x68" width="32" description="">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Data register for read and write operations" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_SPI_DATA2" acronym="QSPI0_SPI_DATA2" offset="0x6C" width="32" description="">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Data register for read and write operations" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="QSPI0_SPI_DATA3" acronym="QSPI0_SPI_DATA3" offset="0x70" width="32" description="">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Data register for read and write operations" range="31 - 0" rwaccess="RW"/>
	</register>
</module>